client/results/rq2/h1/stresstest/stress_scaling_summary.txt
H1 stress scaling benchmark
Date: Thu Jul 30 20:52:07 UTC 2026
=================================

=================================
Running test with 2 clients
=================================
Checking https://10.1.0.116:8443/...
starting benchmark...
spawning thread #0: 1 total client(s). 25000 total requests
spawning thread #1: 1 total client(s). 25000 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: http/1.1
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 31.63s, 1580.60 req/s, 6.93MB/s
requests: 50000 total, 50000 started, 50000 done, 50000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 50000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 219.20MB (229850000) total, 6.44MB (6750000) headers (space savings 0.00%), 210.91MB (221150000) data
                     min         max         mean         sd        +/- sd
time for request:      507us     10.83ms      1.19ms       428us    88.60%
time for connect:     7.68ms      9.67ms      8.67ms      1.40ms   100.00%
time to 1st byte:    11.16ms     15.67ms     13.42ms      3.19ms   100.00%
req/s           :     790.33      882.18      836.25       64.95   100.00%

=================================
Running test with 4 clients
=================================
Checking https://10.1.0.116:8443/...
starting benchmark...
spawning thread #0: 2 total client(s). 25000 total requests
spawning thread #1: 2 total client(s). 25000 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: http/1.1
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 21.45s, 2331.39 req/s, 10.22MB/s
requests: 50000 total, 50000 started, 50000 done, 50000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 50000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 219.20MB (229850000) total, 6.44MB (6750000) headers (space savings 0.00%), 210.91MB (221150000) data
                     min         max         mean         sd        +/- sd
time for request:      442us     17.12ms      1.56ms       725us    83.31%
time for connect:    12.80ms     17.31ms     14.62ms      1.91ms    75.00%
time to 1st byte:    17.91ms     21.04ms     19.80ms      1.40ms    75.00%
req/s           :     582.84      698.15      640.46       63.57   100.00%

=================================
Running test with 8 clients
=================================
Checking https://10.1.0.116:8443/...
starting benchmark...
spawning thread #0: 4 total client(s). 25000 total requests
spawning thread #1: 4 total client(s). 25000 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: http/1.1
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 15.79s, 3165.99 req/s, 13.88MB/s
requests: 50000 total, 50000 started, 50000 done, 50000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 50000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 219.20MB (229850000) total, 6.44MB (6750000) headers (space savings 0.00%), 210.91MB (221150000) data
                     min         max         mean         sd        +/- sd
time for request:      395us     24.38ms      2.40ms      1.11ms    76.37%
time for connect:     6.33ms     17.24ms     12.76ms      4.34ms    50.00%
time to 1st byte:    13.37ms     27.34ms     20.53ms      4.40ms    62.50%
req/s           :     395.77      425.96      415.92       12.18    75.00%

=================================
Running test with 16 clients
=================================
Checking https://10.1.0.116:8443/...
starting benchmark...
spawning thread #0: 8 total client(s). 25000 total requests
spawning thread #1: 8 total client(s). 25000 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: http/1.1
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 14.17s, 3529.71 req/s, 15.47MB/s
requests: 50000 total, 50000 started, 50000 done, 50000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 50000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 219.20MB (229850000) total, 6.44MB (6750000) headers (space savings 0.00%), 210.91MB (221150000) data
                     min         max         mean         sd        +/- sd
time for request:      405us     31.50ms      4.14ms      2.45ms    74.89%
time for connect:     7.43ms     30.74ms     19.31ms      6.78ms    68.75%
time to 1st byte:    14.97ms     49.06ms     30.98ms      9.69ms    68.75%
req/s           :     220.63      299.98      244.51       31.44    87.50%

=================================
Running test with 32 clients
=================================
Checking https://10.1.0.116:8443/...
starting benchmark...
spawning thread #0: 16 total client(s). 25000 total requests
spawning thread #1: 16 total client(s). 25000 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: http/1.1
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 14.08s, 3551.05 req/s, 15.57MB/s
requests: 50000 total, 50000 started, 50000 done, 50000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 50000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 219.20MB (229850000) total, 6.44MB (6750000) headers (space savings 0.00%), 210.91MB (221150000) data
                     min         max         mean         sd        +/- sd
time for request:      469us     41.22ms      8.55ms      4.16ms    73.15%
time for connect:    10.29ms     30.07ms     20.98ms      5.05ms    62.50%
time to 1st byte:    25.13ms     49.15ms     37.37ms      8.09ms    46.88%
req/s           :     111.01      122.21      116.81        4.36    46.88%

=================================
Running test with 64 clients
=================================
Checking https://10.1.0.116:8443/...
starting benchmark...
spawning thread #0: 32 total client(s). 25000 total requests
spawning thread #1: 32 total client(s). 25000 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: http/1.1
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 11.93s, 4189.99 req/s, 18.37MB/s
requests: 50000 total, 50000 started, 50000 done, 50000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 50000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 219.20MB (229850000) total, 6.44MB (6750000) headers (space savings 0.00%), 210.91MB (221150000) data
                     min         max         mean         sd        +/- sd
time for request:      600us     71.52ms     14.54ms      6.11ms    74.25%
time for connect:    16.34ms     65.67ms     40.98ms     10.91ms    75.00%
time to 1st byte:    43.04ms    101.55ms     68.96ms     15.65ms    71.88%
req/s           :      65.45       73.84       68.61        2.79    51.56%

=================================
Running test with 128 clients
=================================
Checking https://10.1.0.116:8443/...
starting benchmark...
spawning thread #0: 64 total client(s). 25000 total requests
spawning thread #1: 64 total client(s). 25000 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: http/1.1
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 11.50s, 4347.95 req/s, 19.06MB/s
requests: 50000 total, 50000 started, 50000 done, 50000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 50000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 219.20MB (229850000) total, 6.44MB (6750000) headers (space savings 0.00%), 210.91MB (221150000) data
                     min         max         mean         sd        +/- sd
time for request:      591us    835.15ms     28.33ms     16.37ms    86.27%
time for connect:    16.99ms     73.61ms     43.74ms     10.59ms    75.78%
time to 1st byte:    34.93ms    890.85ms    160.18ms    188.85ms    88.28%
req/s           :      33.94       38.05       35.19        1.19    71.09%

=================================
Running test with 256 clients
=================================
Checking https://10.1.0.116:8443/...
starting benchmark...
spawning thread #0: 128 total client(s). 25000 total requests
spawning thread #1: 128 total client(s). 25000 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: http/1.1
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 14.09s, 3548.60 req/s, 15.56MB/s
requests: 50000 total, 50000 started, 50000 done, 50000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 50000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 219.20MB (229850000) total, 6.44MB (6750000) headers (space savings 0.00%), 210.91MB (221150000) data
                     min         max         mean         sd        +/- sd
time for request:      657us       4.23s     64.89ms    158.87ms    99.44%
time for connect:    24.11ms    151.73ms     87.51ms     26.01ms    69.14%
time to 1st byte:   121.50ms       3.49s    789.52ms    785.30ms    91.02%
req/s           :      13.87       19.83       15.43        1.47    76.56%

Stress test completed